@megan07 happy to report that your fix worked.

Here is the commit with the fix: https://github.com/jamiet-msm/hive_partitioned_table_issue/commit/f7f8e76556e37c3336d9bc7289c90005c7096850

and here is the proof, note 0 changes on the subsequent apply:

```shell
terraform apply -var project=project-name -var region=europe-west2

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # google_bigquery_dataset.hive_store will be created
  + resource "google_bigquery_dataset" "hive_store" {
      + creation_time              = (known after apply)
      + dataset_id                 = "hive_store"
      + delete_contents_on_destroy = false
      + etag                       = (known after apply)
      + id                         = (known after apply)
      + last_modified_time         = (known after apply)
      + location                   = "EU"
      + project                    = "project-name"
      + self_link                  = (known after apply)

      + access {
          + domain         = (known after apply)
          + group_by_email = (known after apply)
          + role           = (known after apply)
          + special_group  = (known after apply)
          + user_by_email  = (known after apply)

          + view {
              + dataset_id = (known after apply)
              + project_id = (known after apply)
              + table_id   = (known after apply)
            }
        }
    }

  # google_bigquery_table.hive_table will be created
  + resource "google_bigquery_table" "hive_table" {
      + creation_time       = (known after apply)
      + dataset_id          = "hive_store"
      + deletion_protection = false
      + etag                = (known after apply)
      + expiration_time     = (known after apply)
      + id                  = (known after apply)
      + last_modified_time  = (known after apply)
      + location            = (known after apply)
      + num_bytes           = (known after apply)
      + num_long_term_bytes = (known after apply)
      + num_rows            = (known after apply)
      + project             = "project-name"
      + schema              = (known after apply)
      + self_link           = (known after apply)
      + table_id            = "messages"
      + type                = (known after apply)

      + external_data_configuration {
          + autodetect    = false
          + compression   = "NONE"
          + schema        = jsonencode(
                [
                  + {
                      + mode = "NULLABLE"
                      + name = "column1"
                      + type = "STRING"
                    },
                ]
            )
          + source_format = "NEWLINE_DELIMITED_JSON"
          + source_uris   = [
              + "gs://project-name-bucket/publish/*",
            ]

          + hive_partitioning_options {
              + mode                     = "CUSTOM"
              + require_partition_filter = false
              + source_uri_prefix        = "gs://project-name-bucket/publish/{dt:STRING}/{hr:STRING}/{min:STRING}"
            }
        }
    }

  # google_storage_bucket.bucket will be created
  + resource "google_storage_bucket" "bucket" {
      + force_destroy               = false
      + id                          = (known after apply)
      + location                    = "EU"
      + name                        = "project-name-bucket"
      + project                     = "project-name"
      + self_link                   = (known after apply)
      + storage_class               = "STANDARD"
      + uniform_bucket_level_access = (known after apply)
      + url                         = (known after apply)
    }

  # google_storage_bucket_object.fake_message will be created
  + resource "google_storage_bucket_object" "fake_message" {
      + bucket         = "project-name-bucket"
      + content        = (sensitive value)
      + content_type   = (known after apply)
      + crc32c         = (known after apply)
      + detect_md5hash = "different hash"
      + id             = (known after apply)
      + kms_key_name   = (known after apply)
      + md5hash        = (known after apply)
      + media_link     = (known after apply)
      + name           = "publish/dt=2000-01-01/hr=00/min=00/fake_message.json"
      + output_name    = (known after apply)
      + self_link      = (known after apply)
      + storage_class  = (known after apply)
    }

Plan: 4 to add, 0 to change, 0 to destroy.

Do you want to perform these actions?
  Terraform will perform the actions described above.
  Only 'yes' will be accepted to approve.

  Enter a value: yes

google_bigquery_dataset.hive_store: Creating...
google_storage_bucket.bucket: Creating...
google_bigquery_dataset.hive_store: Creation complete after 2s [id=projects/project-name/datasets/hive_store]
google_storage_bucket.bucket: Creation complete after 2s [id=project-name-bucket]
google_storage_bucket_object.fake_message: Creating...
google_storage_bucket_object.fake_message: Creation complete after 0s [id=project-name-bucket-publish/dt=2000-01-01/hr=00/min=00/fake_message.json]
google_bigquery_table.hive_table: Creating...
google_bigquery_table.hive_table: Creation complete after 1s [id=projects/project-name/datasets/hive_store/tables/messages]

Apply complete! Resources: 4 added, 0 changed, 0 destroyed.
➜  hive_partitioned_table_issue git:(master) ✗ terraform apply -var project=project-name -var region=europe-west2
google_storage_bucket.bucket: Refreshing state... [id=project-name-bucket]
google_bigquery_dataset.hive_store: Refreshing state... [id=projects/project-name/datasets/hive_store]
google_storage_bucket_object.fake_message: Refreshing state... [id=project-name-bucket-publish/dt=2000-01-01/hr=00/min=00/fake_message.json]
google_bigquery_table.hive_table: Refreshing state... [id=projects/project-name/datasets/hive_store/tables/messages]

Apply complete! Resources: 0 added, 0 changed, 0 destroyed.
```
